app/views/chats/_chat.html.erb


  <p><b><%=User.find(message.user_id).name%>:</b> <%= message.statement %><p>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 2], ["LIMIT", 1]]