app/controllers/concerts_controller.rb

  def index
    concert = LoadConcerts.new
    concert.save_listings('test')
    @concerts = Concert.all
---
INSERT INTO "concerts" ("title", "ticket_info", "api_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Joywave, The Aces, Maybird"], ["ticket_info", "$15, 18+"], ["api_id", 8518176], ["created_at", "2017-11-21 15:29:13.504452"], ["updated_at", "2017-11-21 15:29:13.504452"]]
SELECT "concerts".* FROM "concerts"