app/controllers/concerts_controller.rb

  def index
    binding.pry
    concert_object = LoadConcerts.new
    concert_object.concert_logic(params)

    # concert.save_listings('test')
    @concerts = Concert.where(concert_date: )
---
SELECT "concerts".* FROM "concerts" WHERE ("concerts"."concert_date" BETWEEN $1 AND $2)  [["concert_date", "2018-02-21 06:00:00"], ["concert_date", "2018-02-22 15:51:59.924898"]]