app/controllers/shared_experiences_controller.rb

INSERT INTO "chat_boxes" ("concert_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["concert_id", 1], ["created_at", "2017-11-24 22:40:45.264387"], ["updated_at", "2017-11-24 22:40:45.264387"]]
SELECT  "chat_boxes".* FROM "chat_boxes" WHERE "chat_boxes"."concert_id" = $1 LIMIT $2  [["concert_id", 1], ["LIMIT", 1]]
SELECT "messages".* FROM "messages" WHERE "messages"."chat_box_id" = $1  [["chat_box_id", 1]]
SELECT "media_links".* FROM "media_links" WHERE "media_links"."concert_id" = $1  [["concert_id", 1]]
SELECT  "tweets".* FROM "tweets" WHERE "tweets"."concert_id" = $1 ORDER BY "tweets"."id" DESC LIMIT $2  [["concert_id", 1], ["LIMIT", 5]]
---
  def index
    @chat_box = ChatBox.find_or_create_by(concert_id: @concert.id)
    @messages = Message.where(chat_box_id: @chat_box.id)
    @media = MediaLink.where(concert_id: @concert.id)
    # @new_media = MediaLink.new
    @tweets = Tweet.where(concert_id: @concert.id).last(5).reverse

INSERT INTO "messages" ("user_id", "chat_box_id", "statement", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["chat_box_id", 1], ["statement", "test"], ["created_at", "2017-11-24 22:47:35.391585"], ["updated_at", "2017-11-24 22:47:35.391585"]]
---
  def create

    youtube_reg = [
      /^https:\/\/www.youtube.com\/embed\/[0-9a-zA-Z_\-]*$/,
      /^https:\/\/youtu.be\/[0-9a-zA-Z_\-]*$/
      ]
    # if current_user == nil
    #   redirect_to concert_shared_experiences_path, notice: 'must login in to use chat'

    if params['message']['statement'].strip.match?(Regexp.union(youtube_reg))

      if params['message']['statement'].strip.match?(youtube_reg[1])
        embed = params['message']['statement'].strip.match(/^https:\/\/youtu.be\/([0-9a-zA-Z_\-]*$)/)[1]
        params['message']['link'] = "https://www.youtube.com/embed/" + embed
      else
        params['message']['link'] = params['message']['statement'].strip
      end


      record = MediaLink.find_or_initialize_by(media_params)

      if record.new_record?
        record.user_id = current_user.id
        record.media_type = "video"
        record.concert_id = @concert.id
        record.save
        ActionCable.server.broadcast "room_#{@concert.id}", media: render_video(record)
      else
        message = Message.new({statement: "video already posted: " + record.link})
        message.user_id = 1
        message.save

SELECT  "bands".* FROM "bands" INNER JOIN "concert_bands" ON "bands"."id" = "concert_bands"."band_id" WHERE "concert_bands"."concert_id" = $1 ORDER BY "bands"."id" ASC LIMIT $2  [["concert_id", 1], ["LIMIT", 1]]
SELECT  "tweets".* FROM "tweets" WHERE "tweets"."concert_id" = $1 ORDER BY "tweets"."id" DESC LIMIT $2  [["concert_id", 1], ["LIMIT", 1]]
INSERT INTO "tweets" ("user", "message", "concert_id", "twitterID", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
SELECT  "tweets".* FROM "tweets" WHERE "tweets"."twitterID" = $1 LIMIT $2  [["twitterID", 936332087183007745], ["LIMIT", 1]]
---
  def tweet_feed
    top_band_with_twitter = @concert.bands.where.not('twitter': nil)
    if top_band_with_twitter == []
      current_handle = @concert.title.gsub(/[^A-Za-z0-9]/, '_')
    else
      current_handle = top_band_with_twitter.first.twitter
    end

    recent_tweet = Tweet.where(concert_id: @concert.id).last
    if recent_tweet == nil || Time.now - recent_tweet.created_at > 60
      testtwit = LoadTweets.new
      tweets = testtwit.setStream(current_handle)
      new_tweet_array = []
      tweets.each do |tweet|
        Tweet.find_or_initialize_by(twitterID: tweet.id) do |new_tweet|

SELECT  "concerts".* FROM "concerts" WHERE "concerts"."id" = $1 LIMIT $2  [["id", 76], ["LIMIT", 1]]
---
  def set_concert
    @concert = Concert.find(params[:concert_id])