app/controllers/shared_experiences_controller.rb

INSERT INTO "media_links" ("concert_id", "user_id", "link", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["concert_id", 1], ["user_id", 2], ["link", "test"], ["created_at", "2017-11-27 03:40:27.184186"], ["updated_at", "2017-11-27 03:40:27.184186"]]
---
  def add_media
    # binding.pry
    if current_user == nil
      redirect_to concert_shared_experiences_path, notice: 'must login in to add media'
    elsif params['user_media']['link'].match? (/^https:\/\/.*/)
      media = MediaLink.new(media_params)
      # binding.pry
      media.concert_id = @concert.id
      media.user_id = current_user.id
      # binding.pry
      if media.save